# Data Warehouse Utilization

In [1]:
%load_ext sql

In [2]:
%%sql
sqlite:///CourseDataWarehouse.db

'Connected: @CourseDataWarehouse.db'

## On which day are the most/least classes held?

In [3]:
%%sql
SELECT DISTINCT Day, count(Day) as Count
FROM TIMECODES_DW
GROUP BY Day
ORDER BY Count DESC;

 * sqlite:///CourseDataWarehouse.db
Done.

[('T', 249),
 ('W', 243),
 ('R', 206),
 ('M', 196),
 ('F', 137),
 ('S', 45),
 ('U', 14)]

## Which classroom is the most utilized and what programs hold classes there?

In [4]:
%%sql
SELECT location, COUNT(course_id) as count
FROM LOCATIONS_DW 
    JOIN CLASS_FACTS_DW USING (location_id)
    JOIN COURSES_DW USING (course_id)
GROUP BY location 
ORDER BY count DESC
LIMIT 10;

 * sqlite:///CourseDataWarehouse.db
Done.

[('DSB 112', 171),
 ('BNW 341', 160),
 ('DSB 109', 158),
 ('NHS 301', 158),
 ('CNS 101', 157),
 ('DSB 106', 157),
 ('CNS 108', 154),
 ('BNW 137', 152),
 ('CNS 106', 149),
 ('DSB 108', 148)]

In [5]:
%%sql
SELECT program_name AS Program, count(catalog_id) AS Count
FROM COURSES_DW 
    JOIN CLASS_FACTS_DW USING (course_id)
    JOIN PROGRAMS_DW USING (program_id)
    JOIN LOCATIONS_DW USING (location_id)
    WHERE location = 'DSB 112'
    GROUP BY program_name
    ORDER BY Count DESC;

 * sqlite:///CourseDataWarehouse.db
Done.

[('Accounting', 63),
 ('Marketing', 38),
 ('Management', 26),
 ('Finance', 21),
 ('Operations Management', 10),
 ('Information Systems', 8),
 ('Taxation', 5)]

## Which professors have the most diverse courseload?

In [8]:
%%sql
SELECT professor_id, Name, COUNT(DISTINCT Course_id) AS CourseCount
FROM PROFESSORS_DW
    JOIN CLASS_FACTS_DW USING (professor_id)
    JOIN COURSES_DW USING (course_id)
    GROUP BY professor_id, Name
    ORDER BY CourseCount DESC
    LIMIT 10;

 * sqlite:///CourseDataWarehouse.db
Done.

[(161, 'Jeffrey N.  Denenberg', 18),
 (110, 'Michael P.  Pagano', 17),
 (65, 'Aaron R.  Van Dyke', 16),
 (111, 'Qin   Zhang', 15),
 (511, 'Amalia I.  Rusu', 15),
 (576, 'Shannon P.  Gerry', 14),
 (67, 'Diane J.  Brousseau', 13),
 (84, 'John R.  Miecznikowski', 13),
 (93, 'Amanda S.  Harper-Leatherman', 13),
 (117, 'Virginia A.  Kelly', 13)]

In [9]:
%%sql
SELECT DISTINCT term, catalog_id, course_title
FROM COURSES_DW
    JOIN CLASS_FACTS_DW USING (course_id)
    WHERE professor_id = '161';

 * sqlite:///CourseDataWarehouse.db
Done.

[('Fall2017', 'ECE 0461', 'Green Power Generation'),
 ('Fall2017', 'EE 0213L', 'Electric Circuits Lab'),
 ('Fall2017', 'EE 0231', 'Introduction to Electronics Circuits and Devices'),
 ('Fall2017', 'EE 0231L', 'Electronics Circuits Lab'),
 ('Fall2017', 'EE 0361', 'Green Power Generation'),
 ('Fall2018', 'BEN 0331', 'Biomedical Signal Processing'),
 ('Fall2018', 'CR 0331', 'Biomedical Signal Processing'),
 ('Fall2018', 'EE 0213L', 'Electric Circuits Lab'),
 ('Fall2018', 'EE 0231L', 'Electronics Circuits Lab'),
 ('Spring2018', 'CR 0245L', 'Digital Design I Lab'),
 ('Spring2018', 'ECE 0411', 'Digital Signal Processing'),
 ('Spring2018', 'EE 0331L', 'Analog Electronics Lab'),
 ('Spring2018', 'EG 0300', 'Feedback Control Systems'),
 ('Spring2018', 'ME 0400', 'Feedback and Control Systems'),
 ('Spring2019', 'ECE 0495', 'Power Generation and Distribution'),
 ('Spring2019', 'EE 0331L', 'Analog Electronics Lab'),
 ('Spring2019', 'EE 0385', 'Power Generation and Distribution'),
 ('Spring2019', 'SW 0461', 'Pattern Recognition')]

## Which professor teaches in the highest number of programs?

In [10]:
%%sql
SELECT professor_id, Name, COUNT(DISTINCT program_name) AS Prof_count
FROM PROFESSORS_DW
    JOIN CLASS_FACTS_DW USING (professor_id)
    JOIN PROGRAMS_DW USING (program_id)
    GROUP BY Name
    ORDER BY Prof_count DESC
    LIMIT 10;

 * sqlite:///CourseDataWarehouse.db
Done.

[(161, 'Jeffrey N.  Denenberg', 7),
 (112, 'James P.  Cavallo', 5),
 (17, 'Anna M.  Lawrence', 4),
 (586, 'Djedjiga   Belfadel', 4),
 (162, 'Douglas A.  Lyon', 4),
 (892, 'Ellen M.  Lee', 4),
 (192, 'Emily J.  Orlando', 4),
 (20, 'Martha S.  LoMonaco', 4),
 (290, 'Mary Ann M.  Carolan', 4),
 (660, 'Michelle Leigh  Farrell', 4)]

In [11]:
%%sql
SELECT DISTINCT program_name
FROM CLASS_FACTS_DW
    JOIN PROGRAMS_DW USING (program_id)
    WHERE professor_id = '161';

 * sqlite:///CourseDataWarehouse.db
Done.

[('Electrical and Computer Engineering',),
 ('Electrical Engineering',),
 ('Bioengineering',),
 ('Computer Engineering',),
 ('Engineering',),
 ('Mechanical Engineering',),
 ('Software Engineering',)]

## Which program has the most/least count of courses?

In [12]:
%%sql
SELECT DISTINCT program_name, COUNT(DISTINCT course_title) as Course_count
    FROM PROGRAMS_DW
        JOIN CLASS_FACTS_DW USING (Program_id)
        JOIN COURSES_DW USING (Course_id)
    GROUP BY program_name
    ORDER BY Course_count DESC
LIMIT 10;

 * sqlite:///CourseDataWarehouse.db
Done.

[('Biology', 71),
 ('Nursing', 68),
 ('Psychology', 67),
 ('English', 63),
 ('Mathematics', 45),
 ('History', 43),
 ('Education', 38),
 ('Religious Studies', 38),
 ('Communication', 34),
 ('Chemistry', 30)]

In [13]:
%%sql
SELECT DISTINCT program_name, COUNT(DISTINCT course_title) as Course_count
    FROM PROGRAMS_DW
        JOIN CLASS_FACTS_DW USING (Program_id)
        JOIN COURSES_DW USING (Course_id)
    GROUP BY program_name
    ORDER BY Course_count
LIMIT 10;

 * sqlite:///CourseDataWarehouse.db
Done.

[('Black Studies', 1),
 ('English for Engineers', 1),
 ('Humanitarian Action', 1),
 ('Irish Studies', 1),
 ('Latin American and Caribbean Studies', 1),
 ('Women, Gender, and Sexuality Studies', 1),
 ('Environmental Studies', 2),
 ('Graphic Design', 2),
 ('Greek', 2),
 ('Humanities', 2)]

## Which classes go over capacity the most frequently?

In [4]:
%%sql
SELECT COURSES_DW.CatalogYear, professor_id, COURSES_DW.Course_id, Catalog_id, Course_title, Timecodes, Cap, Actual, Remaining
FROM COURSES_DW    
    JOIN CLASS_FACTS_DW USING (course_id)
    JOIN TIMECODES_DW USING(Timecode_id)
    WHERE Remaining < 0 AND Cap != 0
    --GROUP BY course_title
    ORDER BY professor_id
    LIMIT 10;

 * sqlite:///CourseDataWarehouse.db
Done.

[('2017_2018', 2, 135, 'AC 0012', 'Introduction to Management Accounting', "['MR 1100am-1215pm 01/16-05/01 DSB 108']", 25, 27, -2),
 ('2017_2018', 2, 135, 'AC 0012', 'Introduction to Management Accounting', "['MR 1100am-1215pm 01/16-05/01 DSB 108']", 25, 27, -2),
 ('2017_2018', 2, 135, 'AC 0012', 'Introduction to Management Accounting', "['MR 1100am-1215pm 01/16-05/01 DSB 108']", 25, 27, -2),
 ('2017_2018', 2, 135, 'AC 0012', 'Introduction to Management Accounting', "['MR 1230pm-0145pm 01/16-05/01 DSB 108']", 25, 29, -4),
 ('2017_2018', 2, 135, 'AC 0012', 'Introduction to Management Accounting', "['MR 1230pm-0145pm 01/16-05/01 DSB 108']", 25, 29, -4),
 ('2017_2018', 2, 135, 'AC 0012', 'Introduction to Management Accounting', "['MR 1230pm-0145pm 01/16-05/01 DSB 108']", 25, 29, -4),
 ('2017_2018', 3, 161, 'AC 0330', 'Auditing', "['MR 0200pm-0315pm 09/05-12/11 DSB 112']", 26, 27, -1),
 ('2017_2018', 3, 161, 'AC 0330', 'Auditing', "['MR 0200pm-0315pm 09/05-12/11 DSB 112']", 26, 27, -1),
 ('2017_2018', 3, 161, 'AC 0330', 'Auditing', "['MR 0330pm-0445pm 09/05-12/11 DSB 112']", 26, 27, -1),
 ('2017_2018', 3, 161, 'AC 0330', 'Auditing', "['MR 0330pm-0445pm 09/05-12/11 DSB 112']", 26, 27, -1)]

## Which classes are attracting <10 students/which classes are the least popular?

In [39]:
%%sql
-- Find classes where actual is <10 
-- Also get the count of each value
SELECT Course_title as Course, Catalog_id, Name, COURSES_DW.CatalogYear, Term, Actual
    FROM COURSES_DW
    JOIN CLASS_FACTS_DW USING (course_id)
    JOIN PROFESSORS_DW USING (professor_id)
    JOIN TIMECODES_DW USING (timecode_id)
    JOIN PROGRAMS_DW USING (program_id)
    WHERE Actual < 10
    GROUP BY Course_title
    ORDER BY Actual DESC

LIMIT 20;

 * sqlite:///CourseDataWarehouse.db
Done.

[('Advanced Linear Systems', 'ECE 0457', 'Hongmei   Li', '2018_2019', 'Fall2018', 9),
 ('Advanced Portfolio Workshop', 'ENW 0399', 'Michael C.  White', '2017_2018', 'Spring2018', 9),
 ('Applied Statistics II', 'MA 0418', 'Benjamin   Fine', '2017_2018', 'Spring2018', 9),
 ('Art of Africa, the Caribbean, and the Americas', 'AH 0013', 'Dawn M.  Pilotti', '2017_2018', 'Summer2018', 9),
 ('Biochemistry Lab', 'BI 0324L', 'Aaron R.  Van Dyke', '2017_2018', 'Fall2017', 9),
 ('Biology Research I', 'BI 0391', 'Soyong   Byun', '2017_2018', 'Fall2017', 9),
 ('Biomechanics', 'BEN 0201', 'Susan L.  Freudzon', '2018_2019', 'Fall2018', 9),
 ('Biomedical Imaging', 'BEN 0332', 'Susan L.  Freudzon', '2017_2018', 'Spring2018', 9),
 ('Building Brand Equity', 'MK 0535', 'Mark S.  Ligas', '2017_2018', 'Winter2018', 9),
 ('Capital Budgeting', 'FI 0575', 'Thomas E.  Conine', '2018_2019', 'Spring2019', 9),
 ('Chemical Analysis Lab', 'CH 0222L', 'Amanda S.  Harper-Leatherman', '2017_2018', 'Spring2018', 9),
 ('Chemical Instrumentation', 'CH 0326', 'Amanda S.  Harper-Leatherman', '2017_2018', 'Fall2017', 9),
 ('Collaboration and Consultation for the Special Educator', 'SE 0550', 'Deborah L.  Edelman', '2017_2018', 'Summer2018', 9),
 ('Communication Processes in Organizations: Negotiation', 'CO 0321', 'Michael P.  Pagano', '2017_2018', 'Fall2017', 9),
 ('Comprehensive Exam in Clinical Mental Health Counseling', 'CN 0099', 'Tracey   Robert', '2017_2018', 'Fall2017', 9),
 ('Comprehensive Examination in School Psychology', 'PY 0099', 'Paula   Gill Lopez', '2018_2019', 'Spring2019', 9),
 ('Contemporary Spanish Theatre', 'SP 0346', 'Jerelyn M.  Johnson', '2017_2018', 'Fall2017', 9),
 ('Coordinating Seminar', 'GM 0381', 'Eileen   Wilkinson', '2017_2018', 'Fall2017', 9),
 ('Coordinating Seminar I', 'SP 0381', 'Jerelyn M.  Johnson', '2017_2018', 'Spring2018', 9),
 ('Criminal Justice System Seminar', 'SO 0279', 'Rose P.  Rodrigues', '2017_2018', 'Summer2018', 9)]